----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 300, 300]           1,952
              ReLU-2         [-1, 16, 300, 300]               0
            Conv2d-3         [-1, 16, 300, 300]           6,416
              ReLU-4         [-1, 16, 300, 300]               0
         MaxPool2d-5         [-1, 16, 150, 150]               0
            Conv2d-6         [-1, 16, 150, 150]           6,416
              ReLU-7         [-1, 16, 150, 150]               0
            Conv2d-8         [-1, 16, 150, 150]           6,416
              ReLU-9         [-1, 16, 150, 150]               0
           Conv2d-10         [-1, 16, 150, 150]           6,416
             ReLU-11         [-1, 16, 150, 150]               0
        MaxPool2d-12           [-1, 16, 75, 75]               0
           Conv2d-13           [-1, 32, 75, 75]          12,832
             ReLU-14           [-1, 32, 75, 75]               0
           Conv2d-15           [-1, 32, 75, 75]          25,632
             ReLU-16           [-1, 32, 75, 75]               0
UpsamplingBilinear2d-17         [-1, 32, 150, 150]               0
           Conv2d-18         [-1, 16, 150, 150]           4,624
             ReLU-19         [-1, 16, 150, 150]               0
UpsamplingBilinear2d-20         [-1, 16, 300, 300]               0
           Conv2d-21         [-1, 16, 300, 300]           2,320
             ReLU-22         [-1, 16, 300, 300]               0
           Conv2d-23          [-1, 1, 300, 300]              17
           Conv2d-24          [-1, 1, 300, 300]              17
           Conv2d-25          [-1, 1, 300, 300]              17
           Conv2d-26          [-1, 1, 300, 300]              17
================================================================
Total params: 73,092
Trainable params: 73,092
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.34
Forward/backward pass size (MB): 116.04
Params size (MB): 0.28
Estimated Total Size (MB): 116.67
----------------------------------------------------------------
